addons/pos_epson_printer/static/src/xml/epos_templates.xml

<?xml version="1.0" encoding="UTF-8"?>
<templates id="template" xml:space="preserve">
    <t t-name="ePOSTemplate">
        <s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
            <s:Body>
                <epos-print xmlns="http://www.epson-pos.com/schemas/2011/03/epos-print">
                    <t t-out="0"/>
                </epos-print>
            </s:Body>
        </s:Envelope>
    </t>

    <t t-name="ePOSPrintImage">
        <t t-call="ePOSTemplate">
            <image t-att-width="width" t-att-height="height" align="center" t-esc="image"/>
            <cut type="feed"/>
        </t>
    </t>

    <t t-name="ePOSDrawer">
        <t t-call="ePOSTemplate">
            <pulse/>
        </t>
    </t>
</templates>
